# Clone Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudFilter..::..Clone Method
PointCloudFilter Class See Also
---
Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public PointCloudFilter Clone()
```

Visual Basic
---
```text
Public Function Clone As PointCloudFilter
```

Visual C++
---
```text
public:
PointCloudFilter^ Clone()
```

# ### Return Value
A copy of the original filter.
# See Also
PointCloudFilter Class
Autodesk.Revit.DB.PointClouds Namespace